export function getLastName(gender: 'male' | 'female') {
  const girlDoubleNames = ['叶婧', '孤琦', '虹柏', '青曦', '笑玫', '普楠', '真慧', '燕虹', '姗翔', '诗如', '晴檀', '嫣璐', '美幽', '兰倚', '漫慧', '芷笑', '晓姿', '娜枫', '萱茜', '竹羽', '秀卓', '妙以', '岚涵', '舞缦', '娥书', '新娇', '芹钰', '宛松', '薇丝', '馨壁', '敏美', '雁莺', '宸馥', '颖柏', '筠珠', '熙君', '淑蓉', '凤松', '艺双', '晓颖', '羽睿', '鸣嫣', '虹迪', '翠语', '明芝', '嫦念', '檀莹', '岚若', '佑又', '向清', '珍燕', '蕊怜', '絮惠', '霞珍', '妮蓉', '艳熙', '榆雨', '以涵', '听靖', '绿水', '若琴', '仙痴', '听影', '正松', '睿爽', '影兰', '云兰', '荣秋', '榆樱', '辰甜', '欣清', '璇碧', '宛仙', '芊馨', '蓉露', '洁芳', '缦语', '琳翔', '琼松', '娅欢', '真水', '媚萱', '幻含', '菊樱', '缘翠', '晓蓝', '红竹', '新安', '莲思', '颖青', '梦榆', '筠觅', '馥菱', '婉媛', '念漫', '萱平', '嘉萱', '又幻', '仙谷', '悦熙', '念柏', '如梦', '翔娇', '艳兔', '悦莉'];
  const girlSingleNames = '秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦';
  const boyDoubleNames = ['鹏涛', '炎彬', '鹤轩', '越彬', '风华', '靖琪', '明诚', '高格', '光华', '国源', '冠宇', '晗昱', '涵润', '翰飞', '嘉懿', '煜城', '懿轩', '烨伟', '苑博', '伟泽', '熠彤', '鸿煊', '博涛', '烨霖', '烨华', '煜祺', '智宸', '正豪', '建辉', '晋鹏', '天磊', '绍辉', '泽洋', '明轩', '健柏', '鹏煊', '昊强', '伟宸', '博超', '君浩', '子骞', '明辉', '昊然', '明杰', '立诚', '立轩', '立辉', '峻熙', '弘文', '熠彤', '鸿煊', '烨霖', '哲瀚', '鑫鹏', '致远', '俊驰', '瑾瑜', '皓轩', '擎苍', '擎宇', '志泽', '睿渊', '楷瑞', '子轩', '弘文', '哲瀚', '雨泽', '鑫磊', '修杰', '伟诚', '翰海', '昊乾', '浩博', '和安', '弘博', '宏恺', '鸿朗', '华奥', '华灿', '嘉慕', '坚秉', '建明', '金鑫', '锦程', '雨泽', '烨磊', '晟睿', '天佑', '文昊', '修洁', '黎昕', '远航', '旭尧', '鸿涛', '伟祺', '荣轩', '越泽', '浩宇'];
  const boySingleNames = '玄鸿守鹰铎赐宪坤问巡曾同宗展挺良寒渊殿佩川闻阔俯墨社栋韩岚昌浦松津吏荣名岩宋彭征力堂鸣御柴峻代段生战';

  const isSingle = Math.random() > 0.5;

  if (gender === 'male') {
    return isSingle
      ? boySingleNames[Math.floor(Math.random() * boySingleNames.length)]
      : boyDoubleNames[Math.floor(Math.random() * boyDoubleNames.length)];
  }
  return isSingle
    ? girlSingleNames[Math.floor(Math.random() * girlSingleNames.length)]
    : girlDoubleNames[Math.floor(Math.random() * girlDoubleNames.length)];
}
